/*
Завдання 3: Сканер відкритих портів (Арифметика вказівників) Є масив зі списком
портів. Кінець списку позначається нулем 0. Використовуючи тільки вказівники
(оператор * та ptr++, жодних лічильників i та []), знайдіть і виведіть усі порти,
значення яких більше за 1024.
*/

#include <iostream>

int main() {
    int scannedPorts[] = {22, 80, 8080, 443, 3306, 21, 0};
    int *ptr = scannedPorts;

    while (*ptr != 0) {
        if (*ptr > 1024)
            std::cout << *ptr << " ";
        ++ptr;
    }

    return 0;
}