/*Рівень 1: Базовий (Синтаксис та Виправлення)
Фокус: Робота з типами даних, cout та cin.

3. "Коментатор": Взяти попередньо написаний код і додати до нього однорядкові коментарі для кожної дії та один
багаторядковий коментар на початку з описом автора та мети програми.*/



/*
 Сергій Сергієнко
 Мета: Навчитись оголошувати та виводити різні змінні.
 */

//Під'єднуємо бібліотеки:
#include <iostream>
#include <string>

int main() {

    //Оголошуємо потрібні змінні:
    short number = 10;
    float numberFloat = 2.5;
    char symbol = 'a';
    std::string word = "privit";
    bool logical = true;

    //Виводимо змінні в термінал:
    std::cout << number << '|' << numberFloat << '|' << symbol << '|' << word << '|' << logical;
}