/*
Рівень 1: Базовий (Синтаксис та Розуміння)
Фокус: Механіка перевантаження та базові операції з адресами.

2. «Дистанційне керування» (Вказівники):
Оголосіть змінну типу double із значенням ваги (наприклад, 75.5). Створіть
вказівник, який зберігатиме адресу цієї змінної. Виведіть на екран саму адресу
(через вказівник). Потім, використовуючи тільки вказівник (операцію розіменування *),
змініть значення оригінальної змінної на 80.2 і виведіть оригінальну змінну на екран,
щоб довести, що вона змінилася.
*/

#include <iostream>

int main() {
    double weight = 75.5;
    double *point = &weight;

    std::cout << "Адреса вказівника: " << point << std::endl;
    std::cout << "Значення змінної до: " << weight << std::endl;

    *point = 80.2;

    std::cout << "Значення змінної після: " << weight << std::endl;

    return 0;
}