/*
Рівень 3: Архітектура та Злам (Краш-тести та Безпека)
Фокус: Розуміння того, як ламається компілятор та захист від падінь.

1. «Зламай компілятор» (Ambiguous Call): Ваше завдання — навмисно написати такий
код, який не скомпілюється через помилку неоднозначності (ambiguous call). Створіть
дві перевантажені функції (наприклад, одна приймає int та double, а інша — double
та int). У main викличте цю функцію так, щоб компілятор не зміг обрати правильний
варіант. Закоментуйте проблемний виклик і напишіть текстом пояснення, чому компілятор
"заплутався".
*/

int ambiguousCall(int valueOne, double valueTwo);
int ambiguousCall(double valueOne, int valueTwo);

int main() {
    int numberOne = 6;
    int numberTwo = 7;

    //Помилка, бо всі 2 функціі можуть зробити перетворення числа, а компілятор не може обрати один з функцій:
    ambiguousCall(numberOne, numberTwo);

    return 0;
}

