#include <iostream>
#include "Dog.h"
#include "Cat.h"
#include "Parrot.h"
#include "String.h"
#include "BitString.h"

/*
Завдання №1:
Створити базовий клас «Домашня тварина» і похідні класи «Собака», «Кішка», «Папуга». За допомогою
конструктора встановити ім’я кожної тварини і її характеристики.


Завдання №2:
1. Описати базовий клас «Рядок».
Методи:
1) конструктор без параметрів;
2) конструктор, що приймає як параметр C-рядок (закінчується нульовим байтом);
3) конструктор копіювання;
4) оператор присвоєння;
5) отримання довжини рядка;
6) очищення рядка (зробити рядок порожнім);
7) деструктор;
8) конкатенація рядків (перевантажити оператори + і +=);
9) перевірка на рівність (==) і на нерівність (!=).

2. Описати клас «Бітовий рядок» похідний від класу «Рядок» (Рядки цього класу можуть містити тільки
символи 0 і 1). Якщо в основі рядка, який ініціалізує зустрінуться будь-які символи, відмінні від допустимих,
то «Бітовий рядок» стає порожнім. Вміст рядка розглядається як двійкове подання цілого числа зі знаковим розрядом.
Негативні числа зберігаються в додатковому коді.
Методи:
1) конструктор без параметрів;
2) конструктор, що приймає як параметр C-рядок;
3) конструктор копіювання;
4) оператор присвоєння;
5) деструктор;
6) зміна знаку числа (переклад числа в додатковий код).
7) складання бітових рядків (перевантажити оператори + і +=);
8) перевірка на рівність (==) і на нерівність (!=).
*/


int main() {

    std::cout << "=== Завдання №1 ===\n\n";
    Dog dog{"Рекс", 3, "Німецька вівчарка"};
    Cat cat{"Мурзик", 2, "Сірий"};
    Parrot parrot{"Кеша", 1, true};

    dog.introduce();
    cat.introduce();
    parrot.introduce();


    std::cout << "\n=== Завдання №2 ===\n";
	BitString bit1("0101"); // 5
	BitString bit2("0101"); // 5
	BitString bit3("1100"); // 12

    // Перевірка == та != :
    std::cout << "\nПЕРЕВІРКА == ТА != :\n";
    std::cout << "bit1 (5) == bit2 (5) : " << (bit1 == bit2 ? "так" : "ні") << '\n';
    std::cout << "bit1 (5) != bit3 (12) : " << (bit1 == bit3 ? "ні" : "так") << '\n';

    // Перевірка валідації:
    std::cout << "\nПЕРЕВІРКА ВАЛІДАЦІЇ :\n";
    BitString bitBad("01021");
    std::cout << "Неправильний Bitstring (\"01021\") -> length: " << bitBad.getLength() << '\n';

    // Перевірка математики ( toInt, negate, += ):
    std::cout << "\nПЕРЕВІРКА МАТЕМАТИКИ ( toInt, negate, += ) :\n";
    BitString bit4("0010");  // 2
    BitString bit5("0011");  // 3
    bit4 += bit5;  // 2 + 3 = 5
    std::cout << "2 + 3 == 5 (\"0101\"): " << (bit4 == BitString("0101") ? "так" : "ні") << '\n';

    // Перевірка зміни знаку числа:
    std::cout << "\nПЕРЕВІРКА ЗМІНИ ЗНАКУ ЧИСЛА :\n";
    bit4.negate();  // 5 -> -5 ("1011")
    std::cout << "Negate 5 == -5 (\"1011\"): " << (bit4 == BitString("1011") ? "так" : "ні") << "\n";

    return 0;
}