#include <iostream>
#include "Order.h"
#include "Courier.h"
#include "Dough.h"
#include "Pizza.h"

/*
Завдання 1. Агрегація: «Кур'єр та Замовлення»
Тези завдання:

- Клас Order (Замовлення):
- Поля: номер замовлення (int), адреса доставки (string).
- Метод printInfo(): виводить номер та адресу.

Клас Courier (Кур'єр):
- Поля: ім'я (string), список призначених замовлень (std::vector<const Order*>).
- Метод assignOrder(const Order* order): додає адресу замовлення до списку кур'єра.
- Метод showDeliveries(): виводить ім'я кур'єра та всі взяті замовлення.

Вимоги до main():
- Створити окремо 2 об'єкти Order.
- Створити об'єкт Courier.
- Передати створені замовлення кур'єру за посиланням/вказівником (&).
- Продемонструвати: якщо кур'єр завершив роботу (або видалений), самі об'єкти Order у пам'яті продовжують жити.

Завдання 2. Композиція: «Піца та її Тісто»
Тези завдання:

- Клас Dough (Основа / Тісто):
- Поля: тип тіста (string — наприклад, "тонке" або "пухке"), розмір у см (int).
- Метод printInfo(): виводить параметри основи.

Клас Pizza (Піца):
- Поля: назва (string), об'єкт основи як значення (Dough dough).
- Конструктор Pizza(...): обов'язково ініціалізує внутрішній об'єкт Dough при створенні самої піци (через список ініціалізації).
- Метод printReceipt(): виводить назву піци та викликає dough.printInfo().

Вимоги до main():
- Створити об'єкт Pizza (передавши назву та параметри тіста напряму в конструктор).
- Викликати printReceipt().
- Продемонструвати: клієнт не може створити або передати «чуже» тісто окремо — воно народжується і вмирає разом із піцою (життєвий цикл повністю під контролем Pizza).
*/

int main() {

    std::cout << "\n--- Завдання 1. Агрегація: «Кур'єр та Замовлення» ---\n\n";

    Order order1(101, "Київ, вул. Хрещатик, 1");
    Order order2(102, "Львів, площа Ринок, 10");

    Courier courier("Олег");

    std::cout << "Список Courier:\n";
    courier.assignOrder(&order1);
    courier.assignOrder(&order2);
    courier.showDeliveries();
    std::cout << "\nКінець класу Courier (об'єкти Order продовжують жити)\n";

    std::cout << "\nОб'єкти Order самі по себе:\n";
    order1.printInfo();
    std::cout << "\n";
    order2.printInfo();
    std::cout << "\n";



    std::cout << "\n--- Завдання 2. Композиція: «Піца та її Тісто» ---\n";

    Pizza myPizza("Маргарита", "Тонке", 30);
    std::cout << "\nВиведення рецепту: \n";
    myPizza.printReceipt();


    std::cout << "У класі Pizza немає методу setDough(). Клієнт не може підмінити тісто.\n";
    std::cout << "Перевірка через геттер: Піца має тісто розміром "
              << myPizza.getDough().getSize() << " см.\n";

    std::cout << "\nКінець класу (Руйнування Pizza та з ним Dough :( )\n";

    return 0;
}