/*
Завдання 2. Що виведе наступний код? Без запуску поясніть кожен рядок:
*/


int double_val(int x) { return x * 2; }

int main()
{
    //Робимо вказівник та присвоюємо на double_val:
    int (*fn)(int) = double_val;

    //Виведе 10 (неявне розіменування):
    std::cout << fn(5)  << '\n';

    //Виведе 14 (явне розіменування):
    std::cout << (*fn)(7) << '\n';

    //Повторно присвоюємо вказівник на double_val? :
    fn = double_val;

    //Виведе 12:
    std::cout << fn(fn(3)) << '\n';
}